app/controllers/organizations_controller.rb

INSERT INTO "organizations" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "pathao"], ["created_at", "2024-08-15 11:25:21.090047"], ["updated_at", "2024-08-15 11:25:21.090047"]]
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "admin") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
INSERT INTO "memberships" ("organization_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["organization_id", 1], ["user_id", 3], ["created_at", "2024-08-15 11:25:21.140623"], ["updated_at", "2024-08-15 11:25:21.140623"]]
---
  def create
    @organization = Organization.new(organization_params)
    @user = User.new(user_params.merge({ password: "password", admin: true }))
    if @organization.save && @user.save
      Membership.create(organization_id: @organization.id, user_id: @user.id)

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @organization = Organization.find(params[:id])